{
	"mentorImage": [

   {
    "thumbnailName": "Alhad_oak",
    "name": "Alhad Oak",
    "CompanyName": "LegaLogic",
    "Category": "Legal & Statutory",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "Designated Partner, LegaLogic",
    "longDescription": "Alhad bring over sixteen years of rich experience in Corporate Legal and Corporate Secretarial matters in practice and with reputed organizations.Alhad works on legal matter for clients in varied industries such as Port and Logistics, Information Technology (IT), Information Technology Enabled Services (ITES), Mobile, Education, and Financial Planning Services.His experience ranges from international commercial and technology agreements, International Licensing and Services agreements, company restructuring, Initial Public Offer, IPR, M&A and Corporate Secretarial matters.",
    "number": 47
  },
  {
    "thumbnailName": "amit_mishra",
    "name": "Amit D Mishra",
    "CompanyName": "Interview Mocha",
    "Category": "Product & Technology, Sales & Business Development",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "CEO, Interview Mocha",
    "longDescription": "Amit is CEO of Interview Mocha - a SaaS company providing pre-employment skill testing solutions. Interview Mocha has over 1000 ready skills tests and hundreds of global customers, Interview Mocha is heading towards the world leader in Online recruitment assessment. In his current role, Amit is involved in strategies that brings visitors, convert them into leads, customers and making them successful with the journey with Interview Mocha. He enjoys SaaS and digital marketing and living it daily.",
    "number": 46
  },

  {
    "thumbnailName": "amit",
    "name": "Amit Verma",
    "CompanyName": "Reliance Industries Limited",
    "Category": "Business Model & Strategy, Operations",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "Sr. VP & Head of Digital Transformation for Procurement & Supply Chain, RIL",
    "longDescription": "Amit Verma is a transformation leader with over 20 years of diverse industry experience having worked with Indian and Multinational companies and across geographies of India and Europe. He has a successful track record of driving transformation in service functions with P&L responsibility especially in finance and procurement areas covering all aspects of strategy formulation, operating model creation, driving operating excellence and delivering superior business results. Post a long stint in GE, he currently heads Indirect Procurement for all the Reliance Group companies and is responsible for managing external relationships and negotiating deals of more than 350 Mn USD per annum.He is passionate about start-ups in the area of ecommerce, professional services, digital and gamification. He is a certified Six Sigma Black Belt and passionate about supporting people achieve their life passion though Life Coaching.",
    "number": 45
  },

  {
    "thumbnailName": "anil",
    "name": "Anil Joshi",
    "CompanyName": "Unicorn India Ventures",
    "Category": "Funding, Business Model & Strategy",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "Managing Partner, Unicorn India Ventures",
    "longDescription": "Anil is Managing Partner at Unicorn India Ventures. Prior to this he was heading operations at Mumbai Angels and Bangalore Angels as President. Anil’s experience includes corporate management functions in medium and large organizations, investment in start-ups, project management, joint ventures and business development. He has helped closing approximately 60 start-up deals and was directly involved in closure of over 25 deals. Anil has served on the Board of 5 companies and is involved with various incubation centres as mentor in India and outside India. He is very well respected in the start-up fraternity and is drawn upon by entrepreneurs for advice and strategic direction.",
    "number": 44
  },
   {
    "thumbnailName": "angali_bansal",
    "name": "Anjali Bansal",
    "CompanyName": "TPG Growth",
    "Category": "Business Model & Strategy",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "Senior Advisor, TPG Growth",
    "longDescription": "Anjali Bansal is a Senior Advisor at TPG Growth. She was formerly a Global Partner and MD with TPG Private Equity and a strategy consultant with McKinsey & Company in New York and Mumbai. She founded and led Spencer Stuart's India practice successfully growing it to a highly reputed pan-India platform. Anjali was also a global partner and co-led their Asia Pacific Board & CEO practice as part of the Asia Pacific leadership team. She was listed as one of the “Most Powerful Women in Indian Business” by Business Today and by Fortune Magazine.",
    "number": 44
  },
  {
    "thumbnailName": "anoop_mathur",
    "name": "Anoop Mathur",
    "CompanyName": "Centre of Recognition and Excellence (CORE)",
    "Category": "Business Model & Strategy, Sales & Business Development",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "Founder and President, Centre of Recognition and Excellence (CORE)",
    "longDescription": "Anoop Mathur is the Founder and President of Centre of Recognition and Excellence (CORE). “CIO CHOICE”, part of CORE is a platform for organizations in the Information & Communications Technology space to promote and market their products, services and solutions. Prior to founding CORE, he was the Chairman and Managing Director of Pacific & Strategic Media (PSG – India), a niche and leading Media Company specializing in the ICT domain. In this capacity, Anoop had the P&L responsibility for India and Middle East operations. Through his extensive professional experience in the Healthcare, Insurance, Financial Services, BPO & IT Enabled Services business verticals, he has held senior positions with leading global organizations such as Prudential, Capita, ICICI OneSource, and United Healthcare. Before joining the corporate business environment Anoop was engaged in providing C&F services to the Government and State Trading Corporation of India. He is a Six Sigma Professional and a Licentiate from the Insurance Institute of India.",
    "number": 43
  },

  {
    "thumbnailName": "aravind_chinchure",
    "name": "Aravind Chinchure",
    "CompanyName": "Symbiosis International University",
    "Category": "Legal & Statutory,Product & Technology",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "Chair Professor of Innovation and Entrepreneurship, Symbiosis International University, Pune",
    "longDescription": "Aravind is PhD in Physics with 25 years of experience in R & D, innovation, intellectual property, venture investment, business strategy, policy and teaching. He has worked in large Indian & multinational companies, successfully built a start-up and mentors entrepreneurs based in India and abroad. He has worked on diverse technology areas in the field of materials, electronics, renewable energy, education and information technology.  He is also a researcher, inventor and innovator with 28 research articles published in international journals and 4 patents in the area of fuel cells in different geographies including US, Europe, Japan. He is excited to engage startups working in the area of ICT, healthcare, energy, education, and agriculture to support their efforts in intellectual property, innovation, investment, and strategy.",
    "number": 41
  },
  {
    "thumbnailName": "ashishkumar_chauhan",
    "name": "Ashish Chauhan",
    "CompanyName": "Bombay Stock Exchange",
    "Category": "Business Model & Strategy",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "MD & CEO, Bombay Stock Exchange",
    "longDescription": "Ashish is the MD & CEO of Bombay Stock Exchange (BSE), the first stock exchange of Asia. He is also one of the founders of India's National Stock Exchange (NSE) where he worked from 1992 to 2000. At NSE, he was instrumental in setting up the first screen based trading in India, equities market and first commercial satellite communications network for India. He is best known as the father of modern financial derivatives in India. He also created several path breaking frameworks including Nifty index, NSE certifications in financial markets etc.He holds a B Tech in Mechanical Engineering from IIT Bombay and a PGDM from IIM Kolkata. He is a Distinguished Visiting professor at Ryerson University, Toronto, Canada.",
    "number": 40
  },
  
    {
    "thumbnailName": "ashwin_khasgiwala",
    "name": "Ashwin Khasgiwala",
    "CompanyName": "Reliance Retail",
    "Category": "Product & Tech, Operations, Finance & Accounting, Business Model & Strategy",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "CFO, Reliance Retail",
    "longDescription": "Ashwin is CFO of Reliance Retail, India’s largest Retail Company and subsidiary of Reliance Industries, a Fortune 500 Company. He is a Chartered Accountant and has been associated with the Reliance group for around two decades. Prior to Reliance, he has worked in Deloitte which is one of the big 4 global accounting firms. Apart from Finance, Accounting and Taxation he has been associated with several Business Process Engineering and IT enablement projects in Reliance Group. He takes keen interest in IT and Business Process innovation especially in the area of big data & analytics, mobility solutions and automation.",
    "number": 39
  },

  {
    "thumbnailName": "avnish",
    "name": "Avnish Sabharwal",
    "CompanyName": "Accenture India",
    "Category": "Business Model & Strategy, Sales & Business Development",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "Managing Director, Accenture India",
    "longDescription": "Avnish is corporate strategist with more than 20 years of extensive experience and track record around market development, sales enablement, growth & innovation, digital transformation and leadership development for Top 500 Fortune clients. In his current role as Managing Director- Strategy, Deal Origination and Open Innovation, Accenture in India, he is responsible for designing the firm's growth and profitability road-map and engaging with startups by giving them access to Accenture’s global business via Open Innovation program.He is excited about engaging with startups, especially in the area of big data & analytics, interactive, mobility, automation, cyber-security, gamification and IoT.",
    "number": 38
  },
 
  {
    "thumbnailName": "deepak_narayanan",
    "name": "Deepak Narayanan",
    "CompanyName": "MyCFO",
    "Category": "Finance & Accounting,Business Model & Strategy",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "Co-Founder, MyCFO",
    "longDescription": "Deepak Narayanan runs MyCFO, a leading implementation services brand that provides CFO and Finance Effectiveness services for mid to large corporates. Deepak has been at the forefront in popularizing the concept of ‘CFO services’ in India and in the concept gaining widespread acceptance amongst CEO’s, Promoters, investors, CFO’s, media amongst others. He has worked with Deloitte and Ernst & Young and has consulted companies like Unilever, ITC, Sanofi Aventis, Western Union, Titan Industries, Schreiber group, Syngenta, Solvay Pharma amongst others. Deepak leads Strategy, Business Development, Branding and Public Relations functions at MyCFO. Deepak is a blogger, contributes articles on a regular basis to leading publications, part of NEN, Gen Next Ventures, CIIE, Spark 10 as a mentor, well read, enjoys traveling, watching sport and meeting new people.",
    "number": 36
  },
  {
    "thumbnailName": "Dhruvil_Sanghvi",
    "name": "Dhruvil Sanghvi",
    "CompanyName": "LogiNext",
    "Category": "Business Model & Strategy, Media & Marketing",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "CEO & Co-founder, LogiNext",
    "longDescription": "Recognized as one of the youngest and fastest growing startup CEOs in India, Dhruvil Sanghvi is an alumnus of Carnegie Mellon University. After acquiring a deep experience in logistics and Big Data space in the US market while working with Deloitte Consulting and Ernst & Young Technology Advisory, Dhruvil started LogiNext towards the beginning of 2014, which is backed by IAN and Paytm. He was on the core team of advising the largest logistics company in the US as a part of their last mile route optimization program.Dhruvil strongly supports the idea of sustainable startup ecosystem and has incubated and mentored a gamut of startups in logistics, Big Data and analytics space.",
    "number": 35
  },
  
    {
    "thumbnailName": "sovan_majumdar",
    "name": "Dr. Sovan Majumdar",
    "CompanyName": "Reliance Retail",
    "Category": "Product & Tech, Business Model & Strategy",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "AVP - Business Planning & Strategy, Reliance Retail",
    "longDescription": "Sovan is a Ph.D. with over two and half decades of experience as a specialist in data mining and machine learning. Currently he is part of the Senior Management at Reliance Retail Limited. Prior to joining Reliance Group he has been associated with Mahindra and Mahindra, Bombay Stock Exchange, Revenue Department of Government of India. He has led several big data and advanced analytics projects across various domains in diverse sectors including automotive, financial services, stock market and retail. He is a keen follower of technology innovations in deep learning, tech enabled process optimization, IoT & automation and has over the period been associated with incubators and start-ups. He is also an avid DIY tech enthusiast.",
    "number": 32
  },
  
  {
    "thumbnailName": "jyoti_bansal",
    "name": "Jyoti Bansal",
    "CompanyName": "AppDynamics",
    "Category": "Product & Tech, Business Model & Strategy",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "Founder, AppDynamics",
    "longDescription": "Jyoti is a Silicon Valley leader, product visionary and entrepreneur. He founded AppDynamics in 2008 and ran the company as its Founder & CEO till 2015 during which time AppDynamics rapidly became one of the fastest growing enterprise software companies. AppDynamics was subsequently acquired by Cisco for $ 3.7 billion. Jyoti has been a recipient of many leadership awards. In 2013, he was selected by Forbes as a 'Best Cloud Computing CEO to Work For.' In 2014, he was named 'Best CEO' by San Francisco Business Times at the Annual Tech & Innovation Awards, and was awarded Ernst & Young Entrepreneur of the Year for Northern California in 2016. Before founding AppDynamics, Jyoti held engineering roles at various Silicon Valley startups, including Wily Technology (acquired by CA Technologies), Datasweep (acquired by Rockwell Automation), and netLens (acquired by Microsoft through FAST/NextPage). Jyoti received his BS in Computer Science from the Indian Institute of Technology, Delhi and is the lead inventor on 20+ US patents.",
    "number": 31
  },

{
    "thumbnailName": "karl_mehta",
    "name": "Karl Mehta",
    "CompanyName": "EdCast Inc",
    "Category": "Product & Tech, Business Model & Strategy, Sales & Business Dev, Funding",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "Founder & CEO of EdCast Inc (Investee of GenNext Venture Fund)",
    "longDescription": "Karl Mehta is a serial entrepreneur, investor, engineer, and civil servant with over 20 years of experience in founding, building, and funding technology companies in the U.S. and international markets. He is currently Founder & CEO of EdCast Inc., a next-generation knowledge platform and former Venture Partner at Menlo Ventures. He is Founder of Silicon Valley based tech-driven non-profit, CodeforIndia.org and serves on several non-profit boards for education impact worldwide. Previously, he was the Founder & CEO of PlaySpan Inc., acquired by Visa Inc. in 2011. Karl served as a White House Presidential Innovation Fellow, selected by the Obama Administration during the inaugural 2012-13 term. He was also recently appointed by Governor Brown to the Workforce Investment Board of the State of California. In 2010, Karl won the 'Entrepreneur of the Year' award for Northern California from Ernst & Young. Karl is on the boards of Simpa Networks Inc., and the Chapman University Center for Entrepreneurship and advisor board of Intel Capital.",
    "number": 30
  },
  
 
  {
    "thumbnailName": "manish_maheshwari",
    "name": "Manish Maheshwari ",
    "CompanyName": "Network18 Digital",
    "Category": "Business Model & Strategy, Sales & Business Development, Product & Technology",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "CEO, Network18 Digital",
    "longDescription": "Manish leads Network18 Digital, which is the mobile and internet arm of Network18 Group, India's leading media and entertainment group with over 225 million television viewers and 25 million unique digital visitors per month. Key group properties include moneycontrol.com, Firstpost.com, BookMyShow, HomeShop18, Burrp, CNBC-TV18, CNN-IBN, ETV, Colors, MTV India, Comedy Central, Nick, Viacom18 Motion Pictures and Forbes India.Previously, Manish headed Flipkart's Seller Business and Ecosystem and grew its marketplace by 10x to create a significant lead as India's #1 digital commerce player. Prior to Flipkart, Manish co-founded txtWeb and made it the world’s largest marketplace for text-based apps. txtWeb won several innovation awards e.g. mBillionth, NASSCOM. Outside of work, Manish mentors consumer- and SME-focused tech start-ups as India lead of Ivy League Alumni Angel Network (ILAANET) and is part of India's vibrant entrepreneurial ecosystem. Manish holds an MBA with honours from Wharton Business School. ",
    "number": 29
  },
  
    {
    "thumbnailName": "manish_lachwani",
    "name": "Manish Lachwani",
    "CompanyName": "HeadSpin",
    "Category": "Product & Tech, Business Model & Strategy, Sales & Business Dev",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "Co-Founder and CEO at HeadSpin",
    "longDescription": "Manish is the Co-Founder and CEO at HeadSpin. He was previously the Co-Founder & CTO at Appurify, which was subsequently acquired by Google. Manish has a unique blend of expertise. As a systems architect at Amazon Kindle, he designed the Operating System for all the Kindle line of products. At MontaVista, he was among a select group of MIPS/ARM architects that worked on the first Multicore real time Linux OS, Linux 2.4 and 2.6 versions. Manish holds 30 patents in the areas of USB, Power Management, Battery/Charger systems, System Profiling/Debugging, WiFi/SDIO, Networking and System Validation. Previously, he was a CTO at Zynga.",
    "number": 28
  },
  
  {
    "thumbnailName": "mangesh_panditrao",
    "name": "Mangesh Panditrao",
    "CompanyName": "Shoptimize India",
    "Category": "Product & Technology, Media & Marketing",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "CEO, Shoptimize India",
    "longDescription": "Mangesh Panditrao serves as CEO of Shoptimize. Mangesh has a strong background in enterprise software and operations. This is his second entrepreneurial venture and he is adept at handling the challenges of growing organizations. At Shoptimize, he heads the organization and defines its strategy & product roadmap. Mangesh has completed his BE from Pune University and his MS in Industrial Engineering from Purdue University, USA.",
    "number": 27
  },
  
    {
    "thumbnailName": "manisha_raisingh",
    "name": "Manisha Raisinghani",
    "CompanyName": "LogiNext",
    "Category": "Product & Tech",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "Co-Founder and CTO, LogiNext",
    "longDescription": "Manisha Raisinghani, as the Co-founder and CTO of LogiNext, leads one of the fastest growing SaaS companies catering to logistics and workforce optimization. The company under her guidance has won over different global markets with superior products that work around patented self-learning algorithms. She has won awards, accolades and admirers alike with her technically astute but strategically exploratory mindset. Within a short period of time, she has led LogiNext to the level of global acceptability and recognition. She is actively involved in mentoring young entrepreneurs to enable them to realize their potential. Some of her mentees have gone on to become grand successes in their respective fields. With her experience of converting an idea into an exponentially growing enterprise with a multi-million dollar turnover, year on year, she has become a sought-after advisor on the board of many different companies. She has become the voice of change, being a self-made female leader in a predominantly male-dominated industry. She has always challenged perceptions and altered stereotypes to a point where she is now one of the primary spokespersons for women entrepreneurs in Asia.",
    "number": 27
  },

{
    "thumbnailName": "mihir_parikh",
    "name": "Mihir A. Parikh",
    "CompanyName": "Nishith Desai Associates",
    "Category": "Product & Tech, Business Model & Strategy, Legal",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "Strategic Thought Leader at Nishith Desai Associates",
    "longDescription": "Mihir A. Parikh, PhD, is a strategic thought leader at Nishith Desai Associates and professor at NYU Tandon in New York City. His expertise lies in the areas of strategic impact of technological innovations on organizations and industries. He completed his MBA from Georgia State University, Atlanta followed by a PhD in business administration. In 1997, he joined NYU’s polytechnic school faculty for its technology management programme and was the founding director of the PhD under that programme. In 2004, he joined the University of Central Florida in Orlando as a professor.",
    "number": 26
  },
  
	{
    "thumbnailName": "miten_mehta",
    "name": "Miten Mehta",
    "CompanyName": "Spinta Global Accelerator",
    "Category": "Business Model & Strategy, Funding, Media & Marketing",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "Co-Founder, Spinta Global Accelerator",
    "longDescription": "Miten Mehta is Co-Founder of Spinta Global Accelerator, HQ out of Fremont, CA, that delivers ‘Silicon Valley Acceleration Model Out-Of-Box’ for start-ups and Enterprise in verticals of HealthTech, EdTech, FinTech, & HighTech segments, to help them bring their innovative products and services  faster to the market. He has co-founded four successful start-ups, including three in Silicon Valley, USA – Spintaccel, KloudData, eComLive (InfoSpace) and MoConDi (MobileMedia) in London, UK. Miten has been an investor / advisor to iPsh (Omnicom), JP Mobile (Good) Cronus Ventures, PlaySpan (Visa), WaveMF, Hubilo, Strike, Chatur Ideas, Cloudrino, NextForce and AngelLab among others. Miten served as consultant & non-exec director on board of 63 moons Technologies from Nov 2014 to Dec 2016. Miten is passionate about mentoring & investing in start-ups that super specialize in application of AI & Deep Learning, Virtual & Augmented Reality, 3D, Robotics & IOT, BigData & Predictive Analytics and BlockChain Technologies that leverage SMAC (Social, Mobile, Analytics and Cloud) infra stack, to create tangible value for users and deliver social impact for community.",
    "number": 26
  },
  
  {  
    "thumbnailName": "naresh_shahani",
    "name": "Naresh N Sahani",
    "CompanyName": "BMGI India",
    "Category": "Business Model & Strategy, Operations",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "Managing Director, BMGI India",
    "longDescription": "Naresh is the Managing Director of BMGI India, a global niche management consulting firm specialising in driving innovation, organisational effectiveness and strategy deployment. Naresh works with large companies to deploy innovation projects using a structured approach, trains leaders and managers on various innovation tools and helps organisation build the governance systems to establish an innovation culture in their companies. Some of the companies that he has worked with include Reliance, Dell, Godrej and MaxLife Insurance. Naresh also extensively works with start-ups and coaches business owners as their businesses evolve on the four organizational interfaces of customer, people, process and money. He enables start-ups in developing growth strategies, business differentiators, new business models, brand identity, business plans and scalable processes.",
    "number": 25
  },

  {
    "thumbnailName": "naveen_asrani",
    "name": "Naveen Asrani",
    "CompanyName": "Microsoft Accelerator",
    "Category": "Sales & Business Development, Business Model & Strategy",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "Director – Startups, Microsoft Accelerator",
    "longDescription": "Naveen Asrani is the Director – Startups at Microsoft Accelerator. Prior to Microsoft, Naveen was the Director of Product Management within the Java and Internet of Things (IoT) Product organization at Oracle. At Oracle, Naveen held a number of roles both Regional as well as Global for developers and volume ISVs. He was also responsible for the growth SDN program globally – in particular the Emerging Markets of Brazil, Russia, India, China and Emerging Asia. Naveen held previous roles in Ogilvy on the IBM business across categories and at McCann Erickson on BPL Mobile thereby summing up a career of nearly two decades.",
    "number": 23
  },
  

  
  {
    "thumbnailName": "padmja_ruparel",
    "name": "Padmaja Ruparel",
    "CompanyName": "India Angel Network",
    "Category": "Funding",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "President of Indian Angel Network (IAN)",
    "longDescription": "Padmaja Ruparel is an Angel Investor and President of Indian Angel Network (IAN). She built this organisation from inception, which over 5 years has over 200 investors with a portfolio of 40+ companies across multiple sectors and geographies. With a wide range of experience of over 25 years, Padmaja has been a key player in the entrepreneurial eco system of India. She operationalised the TiE Delhi chapter and has been key in reviving the Indian Venture Capital Association, India’s oldest and largest association of VC and PE firms as CFO of the organisation.",
    "number": 22
  },
  
      {
    "thumbnailName": "peeyush_ranjan",
    "name": "Peeyush Ranjan",
    "CompanyName": "Airbnb Inc.",
    "Category": "Product & Tech",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "VP - Infrastrucure, Airbnb Inc",
    "longDescription": "Peeyush is VP of Infrastructure at Airbnb Inc. Prior to that, he was the Chief Technology Officer at Flipkart. At Flipkart, he built India's biggest datacentre, ran India's biggest ever online sale and pioneered app technologies like Progressive Web Apps. Peeyush has also spent nine years at Google, working on variety of products such as Search, Android and Apps for Business and leading Google's engineering efforts in India. Peeyush has also worked in multiple startups prior to that.  He is a graduate of IIT Kharagpur, Purdue University and University of Washington.",
    "number": 21
  },
  
  {
    "thumbnailName": "prakash_advani",
    "name": "Prakash Advani",
    "CompanyName": "PicoNets",
    "Category": "Product & Technology",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "Co-Founder and CEO, PicoNets",
    "longDescription": "Prakash Advani is the Co-Founder and CEO of PicoNets, a content accelerator solution that improves customer experience. Prakash is a serial entrepreneur, advisor, mentor and jury member. He is Jury member with INSEAD Venture Competition, NASSCOM Product Conclave, IIT E-Summit and Dewang Mehta IT Awards. He is Mentor with RIL’s GenNext Hub and has been the Entrepreneur-in-Residence at INSEAD. He is also active on the social media with over 32,000 twitter follows. Prakash has over 20 years of experience in the IT Industry in areas of Business Development, Marketing, Sales, Alliances and Social Media Marketing. He has wide exposure to IoT, Cloud, Operating Systems, Linux, Open Source, Web, and Networking. In his previous role as the Regional Director for Canonical, he helped setup the Ubuntu business across Cloud, PC and IoT in India and South East Asia. He has helped many new age companies to setup and expand their business in Asia Pacific. Prakash is a frequent speaker and his articles have been published in Times of India, Mint, Economic Times, Deccan Chronicle and several others.",
    "number": 19
  },

  {
    "thumbnailName": "radhesh_kanumury",
    "name": "Radhesh Kanumury",
    "CompanyName": "IBM",
    "Category": "Product & Technology",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "Country Lead, IBM Global Entrepreneur Program",
    "longDescription": "Radhesh leads the Global Entrepreneur Program for IBM India and South Asia. He is responsible for the Strategy and Execution of the Global Entrepreneur Program in India and South Asia. Global Entrepreneur Program is aimed at working with Startups in guiding them in IBM technology they can adapt and have a Go to Market. Prior to this he has been a Software IT Architect in IBM Software Group for over 12 years. He has developed complex architectural solutions involving a broad array of technologies including: Portal, J2EE, Content Management, Business Integration, Security, Database, Analytics, Smarter Cities, and Infrastructure Monitoring leading in many key wins for IBM. He also has been the Chief Architect of APDRP initiative in the Energy and Utility Space. His efforts lead to successful wins in 10 DISCOMs accruing a revenue of more than 15 Million USD for IBM Software.",
    "number": 16
  },
  {
    "thumbnailName": "raghu_raman",
    "name": "Raghu Raman",
    "CompanyName": "Reliance Industries Limited",
    "Category": "Business Model & Strategy, Operations",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "Head of Security, Reliance Industries Ltd",
    "longDescription": "Raghu Raman has possibly one of the most unique career profiles spanning over 25 years. He spent eleven years as an officer in the Indian Armed Forces , followed by another eleven years in the corporate sector before joining the Government as CEO of the National Intelligence Grid. After leaving the Indian Army, Raghu joined the Mahindra Group in 1998 and helped set up Mahindra United World College. Over the next ten years he led various companies, including First Choice, Mahindra SSG and finally DLSI, a Mahindra joint venture with British Aerospace before being handpicked to create and head the National Intelligence Grid, Ministry of Home Affairs in the Government of India. After his five year stint as the founding CEO of NATGRID, Raman joined Reliance Industries as Group President, Risk, Security & New Ventures.",
    "number": 15
  },
  {
    "thumbnailName": "raj_narula",
    "name": "Raj Narula",
    "CompanyName": "InCa Synergies Ltd.",
    "Category": "Funding, Business Model & Strategy",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "CEO, InCa Synergies Ltd., Canada",
    "longDescription": "Raj is a serial entrepreneur, active angel investor in eLearning, Web Portals, Security, hospitality and IT companies. He has helped launch numerous start-ups in Ottawa, Canada taking strategic management roles, and helped to secure over $50 million in early and mid-stage funding for many companies. Additionally he has successfully transacted M&A’s between Canadian and Indian companies. He is currently the founder and CEO of InCa Synergies leading a team of professionals for market introduction and deployment to India of Canadian Solutions in Education / Training, Semi-Conductor, Wireless and Virtualization technologies.Raj was the co-founder and President of TaraSpan Inc. He helped grow the company from 2 people in 2005 to over a 160 people in India.  Raj is also the co-founder and Charter Member of the Ottawa chapter of TiE (the Indus Entrepreneur). He is an executive board member of the University of Ottawa’s Alumni Association and SkillsDox Corporation.",
    "number": 14
  },

  {
    "thumbnailName": "ravi-narayan",
    "name": "Ravi Narayan",
    "CompanyName": "Microsoft",
    "Category": "Business Model & Strategy",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "Global Director, Microsoft",
    "longDescription": "Ravi Narayan is Global Director at Microsoft. He served as a Managing Director at Mentor Partners. Narayan’s start-ups include American Systems International, Nextone Communications and Astuto Networks. He is a Founding Member at PAN-IIT and on the boards of IT and telecom companies in India. He is responsible for the Accelerator Program in Bangalore. Narayan has over 18 years of management and engineering experience in the corporate and startup companies in the telecom and IT Industry. Narayan holds an M.S. in Industrial Engineering and M.B.A. from University of Southern California and received his B.Tech. from IIT Madras.",
    "number": 12
  },
  {
    "thumbnailName": "rohit-bansal",
    "name": "Rohit Bansal",
    "CompanyName": "Reliance Industries Limited",
    "Category": "Media & Marketing, Business Model & Strategy",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "Reliance Industries Limited",
    "longDescription": "Rohit Bansal, 49, group head of corp comms at RIL, is an expert on the media. He read history at St. Stephen’s College and completed an AMP (with alumni status) from Harvard Business School. As a British Chevening scholar funded by the FCO, he has undertaken the young print journalists programme at University of Westminster. He has also completed the business journalists programme at The Times Centre for Media Studies, New Delhi, and attended The European Journalism Centre, Maastricht in a programme for Asian Editors. He is an alum of the European Union Visitors Programme and a distinguished fellow at the Observer Research Foundation (ORF) New Delhi. Mr. Bansal has served on the Board of the News Broadcasters Association (NBA) and has been Resident Editor of The Financial Express, New Delhi; Managing Editor (and later COO) of Independent News Service; Editor-Business, Zee News; Special Correspondent, Television 18; and Senior Business Correspondent, The Times of India. He has been a Trustee on the St Stephen’s Alumni Foundation. Mr. Bansal, in collaboration with Hammurabi & Solomon, has advised CEOs across the spectrum of strategy, regulation, advocacy and the media. He served as Treasurer of The Editors Guild of India and Foundation of Media Professionals. His analysis on politico-economic issues appears on various media platforms.",
    "number": 11
  },
  
  {
    "thumbnailName": "rohit_padharkar",
    "name": "Rohit Padharkar",
    "CompanyName": "HeadSpin",
    "Category": "Product & Tech, Business Model & Strategy, Sales & Business Dev",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "Senior Director of Business Development for APAC, HeadSpin",
    "longDescription": "Rohit Pandharkar is the Senior Director of Business Development for APAC at HeadSpin, a mobile-app-ecosystem that allows app developers to test and monitor their apps over global cellular networks through real-world network metrics of experience. He has 5+ years of experience  with roles such as Deputy CTO at Tech Mahindra’s Enterprise Mobility, Entrepreneur In Residence at Mahindra Group and Senior Researcher at MIT Media Lab, Boston USA. ",
    "number": 10
  },
 
  {
    "thumbnailName": "sachin_tagra",
    "name": "Sachin Tagra",
    "CompanyName": "Capital 18",
    "Category": "Funding, Media & Marketing",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "Vice President & Head, Capital 18",
    "longDescription": "Sachin is a management graduate with seventeen years of prolific business experiences and deep understanding of consumer and retail businesses. He has driven P&Ls of large businesses and made significant contributions in various organizations from the start-up phase of the businesses to profitable scaling up. He  led the Incubation initiative of Capital 18 focused on Start-up investing and also drove investments in e-businesses. He is passionate about working with entrepreneurs and contributing them in building their businesses. Sachin had the opportunity of working with Reliance, The Friedman Group, Merisant and Dabur and have launched various new businesses in India.Sachin is mentor with various incubators and accelerators both in India and Silicon Valley which includes Spinta Global Accelerator, Reliance GenNext Ventures, ISDI, Zone Startups, Edugild & 91SpringBoard.",
    "number": 9
  },
  {
    "thumbnailName": "sagar_apte",
    "name": "Sagar Apte",
    "CompanyName": "CarIQ",
    "Category": "Product & Technology, Sales & Business Development",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "Founder, CarIQ",
    "longDescription": "Sagar Apte founded CarIQ in 2012 to build India’s first connected car platform. At CarIQ, Sagar is the CEO with direct responsibility for sales, and marketing. Sagar has over 16 years of experience across diverse domains such as product management, sales, support, operations, and marketing. He was a Director at PubMatic and EnSim Corporation and has worked with Cerebra, India’s first multimedia PC manufacturer. Sagar has a diploma in Electronics, Graduate in Computer Science, and a MBA in marketing. He is an avid reader and loves driving.",
    "number": 8
  },
  
  {
    "thumbnailName": "sandeep_chaudhary",
    "name": "Sandeep Chaudhary",
    "CompanyName": "Aon Hewitt",
    "Category": "Human Resources, Business Model & Strategy",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "CEO, Aon Hewitt (India)",
    "longDescription": "Sandeep is a seasoned global consultant with expertise in performance management, and executive and broad-based compensation. He currently leads the firm's compensation consulting business across India and the rest of South Asia. His consulting experience also has covered North America and other markets in Asia Pacific.Sandeep manages some of Aon Hewitt's key relationships in India and across the Asia Pacific region. He is a certified trainer and chief faculty for performance & rewards with Hewitt Academy for Strategic HR. Sandeep has been a speaker at numerous Indian and international HR forums. In addition, he has authored many articles and shared perspectives on management issues in leading Indian media publications and news channels such as The Economic Times, Business Standard, and CNBC.",
    "number": 6
  },

  {
    "thumbnailName": "satish_kashyap",
    "name": "Satish Kashyap",
    "CompanyName": "Algo Engines",
    "Category": "Product & Technology, Sales & Business Development",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "Co-founder, Algo Engines",
    "longDescription": "Satish is co-founder of Algo Engines, a SaaS player in the renewable energy analytics space. Satish has over 15 years across renewable energy and technology product management. Satish co-founded General Carbon, which evolved into one of Asia’s largest carbon credit advisory. His prior experience includes stints as investment manager with a private equity fund (IL&FS Group), Director at SunGard and product development at the National Stock Exchange of India Group. Satish has a Bachelor’s in Engineering and a Post Graduate Program in Management (MBA) from Indian School of Business, Hyderabad.",
    "number": 5
  },
  
  {
    "thumbnailName": "shradha_sharma",
    "name": "Shradha Sharma",
    "CompanyName": "YourStory",
    "Category": "Business Model & Strategy, Media & Marketing",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "Chief Editor, YourStory",
    "longDescription": "Shradha has 16 years of print, TV and digital media experience having led high growth teams in Times of India and CNBC TV18.  She started YourStory in 2008 and grew it to become the most credible voice of Indian entrepreneurs which raised its first ever funding in August 2015. According to LinkedIn influencers programme, she is the third most influential personality in the online digital space and was awarded the most outstanding alumni by MICA. She topped the university while pursuing bachelors and masters in History from St. Stephen’s college. Shradha believes that every story matters and needs to be told and celebrated.",
    "number": 3
  },
   
  
  {
    "thumbnailName": "vinod_muthukrishnan",
    "name": "Vinod Muthukrishnan",
    "CompanyName": "CloudCherry",
    "Category": "Sales & Business Development, Media & Marketing",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "Founder & CEO, CloudCherry",
    "longDescription": "Vinod Muthukrishnan spent his formative years at sea working with Maersk Line and V-Ships on cargo ships between 1997 and 2006 before quitting as a certified First Officer.In 2006, Vinod joined a Financial Technology Startup ‘Market Simplified’ based in Chennai/Schaumburg, IL and spent 7 years growing the business with a global client list including Charles Schwab, TD Ameritrade, Maybank and The National Stock Exchange of India among many others.In January 2014, Vinod joined Cloudcherry as the founding CEO to create a team aiming to help Customer-facing businesses measure, track and deliver Customer Delight. In just 2 years, CloudCherry has transformed into an award-winning, and one of the fastest growing SaaS Startups in the country.Vinod is interested in working with startups especially in the SaaS space on building marketing / sales / Client Success engines for growth and generally around scaling the company and creating a unique culture. ",
    "number": 2
  },
  
  {
    "thumbnailName": "vishal_sampat",
    "name": "Vishal Sampat",
    "CompanyName": "Reliance Jio Infocomm",
    "Category": "Product & Tech, Media & Marketing, Business Model & Strategy",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "Chief Digital Officer, Reliance Jio Infocomm",
    "longDescription": "Vishal Sampat is the Chief Digital Officer of Reliance Jio Infocomm Limited. Previously, he was the Founder and CEO of Convonix, a full service internet marketing company that was taken from 3 people to a 400 people company and later acquired by the Publicis Group. Vishal also mentors several start-ups in the digital space, healthcare solutions, e-commerce among others and is interested in selectively mentoring startups that have a good idea, an energetic and passionate team and the will to build a profitable enterprise.",
    "number": 2
  },
  
  {
    "thumbnailName": "vivek_sadhale",
    "name": "Vivek Sadhale",
    "CompanyName": "LegaLogic",
    "Category": "Legal & Statutory",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "Co-Founder, LegaLogic",
    "longDescription": "Vivek brings over seventeen years of extensive experience with an expertise spread over numerous fields including international technology and commercial contracts, successful IPO, top tier venture capital investment and private equity funding, M&A/takeovers, joint venture agreements, managing Investor Relations.Vivek worked with Persistent Systems for thirteen and half years as Company Secretary and Head – Legal and Investor Relations. Vivek has a flair for teaching and writing, and has contributed various articles in leading professional journals, newspapers and souvenirs published at national and international conventions. He is also a visiting faculty at various business schools, professional institutes and law colleges.",
    "number": 1
  },  

  {
    "thumbnailName": "mohit_kapoor",
    "name": "Mohit Kapoor",
    "CompanyName": "Reliance Jio Infocomm",
    "Category": "Business Model & Strategy, Product & Technology, Sales & Business Development",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "Head – Alliances, Reliance Jio Infocomm",
    "longDescription": "Mohit Kapoor is a veteran in telecom space. He is very passionate about entrepreneurship and loves start-ups. He has over 20 years of professional experience and is currently heading Advertising Alliances at Reliance Jio. Mohit has previously held leadership positions in organizations including Alcatel, UTStarcom and Videocon. In his previous stint, he founded two startups – Goolel and iAppster in the technology space. Mohit is an ardent traveler, dog lover and enjoys great cuisines from across the globe. He is an alumnus of NUS Singapore and currently resides in Mumbai, India.",
    "number": 26
  }
]
}