{
    "mentorImage": [
  {
    "thumbnailName": "dr_r_a_mashelkar",
    "name": "Dr. R. A. Mashelkar",
    "CompanyName": "Reliance Innovation Council",
    "Category": "Legal & Statutory",
    "projectImagesPath": "assets/img/jury",
    "shortDescription": "Chairman, Reliance Innovation Council",
    "longDescription": "Dr. R. A. Mashelkar is an independent Director on the Board of Reliance. An eminent scientist and champion of the innovation movement in India, he is the Chairman of Reliance Innovation Council. The President of India bestowed three of India’s highest civilian awards on Dr. R. A. Mashelkar – the Padma Shri in 1991, the Padma Bhushan in 2000, and the Padma Vibhushan in 2014.",
    "twitter": "https://twitter.com/@rameshmashelkar",
    "linkedIn": "",
    "number": 10
  },
  {
    "thumbnailName": "sanjay-mashruwala",
    "name": "Mr. Sanjay Mashruwala",
    "CompanyName": "Reliance Jio Infocomm",
    "Category": "Legal & Statutory",
    "projectImagesPath": "assets/img/jury",
    "shortDescription": "Managing Director, Reliance Jio Infocomm",
    "longDescription": "Mr. Sanjay Mashruwala is Managing Director of Reliance Jio Infocomm Limited and has been associated with RIL since 1981. He has over 32 years of experience in the area of design, engineering, construction and operations of petrochemical, petroleum, polyester and nylon plants. Mr. Mashruwala has also served as Head of Project Implementation at Reliance Petroleum Limited (RIL). Prior to joining RIL, he worked with National Rayon Corporation Limited. Mr. Mashruwala holds a Bachelor's degree in Mechanical Engineering from the Indian Institute of Technology, Bombay and a Master's degree in Engineering from the University of Texas. ",
    "twitter": "",
    "linkedIn": "",
    "number": 9
  },
  {
    "thumbnailName": "ravi",
    "name": "Mr. Ravi Gururaj",
    "CompanyName": "QikPod",
    "Category": "Business Model & Strategy, Funding, Sales & Business Development",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "Founder & CEO, QikPod",
    "longDescription": "Mr. Ravi Gururaj is Founder/CEO of QikPod. Ravi is a founder of 6 technology ventures, 2 of which exited to public NASDAQ companies, an angel investor, a mentor to numerous entrepreneurs, technology executive, and ecosystem evangelist. Ravi is a member of the NASSCOM Executive Council, chairs the NASSCOM Product Council. He is Co-Founder & Co-Chair of HBS Alumni Angels India chapter. Ravi received his MBA with high distinction as a Baker Scholar from Harvard Business School.",
    "twitter": "https://twitter.com/@ravigururaj",
    "linkedIn": "https://www.linkedin.com/in/rgururaj?authType=NAME_SEARCH&authToken=tYg1&locale=en_US&trk=tyah&trkInfo=clickedVertical%3Amynetwork%2CclickedEntityId%3A3978307%2CauthType%3ANAME_SEARCH%2Cidx%3A1-1-1%2CtarId%3A1481097186601%2Ctas%3ARavi%20Gururaj",
    "number": 8
  },
  {
    "thumbnailName": "sanjay_mehta",
    "name": "Mr. Sanjay Mehta",
    "CompanyName": "Angel Investor",
    "Category": "Funding, Business Model & Strategy, Sales & Business Development",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "Angel Investor",
    "longDescription": "Mr. Sanjay Mehta is a serial entrepreneur turned angel investor and has invested in numerous startups in diverse sectors. Having a technology background, he enjoys working with start-ups in mobile, analytics, social & cloud. He understands the nuances of running a start-up hence wants to leverage his experience to help provide not just money but smart money to start-ups. Sanjay is an investor member of Indian Angel Network, Venture Nursery & Mumbai Angel network groups. He is also part of NASSCOM Regional Council & Product Council for West.  His contacts & connects in IT & CIO community is unparalleled. Sanjay Mehta is speaker to various entrepreneur & technology forums. He is also an avid reader & traveller.",
    "twitter": "https://twitter.com/@mehtasanjay",
    "linkedIn": "https://www.linkedin.com/in/mehta-sanjay?authType=NAME_SEARCH&authToken=6pf-&locale=en_US&trk=tyah&trkInfo=clickedVertical%3Amynetwork%2CclickedEntityId%3A1626296%2CauthType%3ANAME_SEARCH%2Cidx%3A1-1-1%2CtarId%3A1481097206708%2Ctas%3ASanjay%20Mehta",
    "number": 7
  },
  
  {
    "thumbnailName": "sandeep-singhal",
    "name": "Mr. Sandeep Singhal",
    "CompanyName": "Nexus Venture Partners",
    "Category": "Legal & Statutory",
    "projectImagesPath": "assets/img/jury",
    "shortDescription": "Co-Founder, Nexus Venture Partners",
    "longDescription": "Mr. Sandeep is a co-founder of Nexus Venture Partners. Sandeep has been an entrepreneur and a pioneer of Venture Capital in India. He was co-founder & CEO of Medusind Solutions, one of the leading healthcare outsourcing companies in India. He also was the co-founder of eVentures India, a leading venture firm focused on early stage ventures in India. Several of his earlier investments have had successful exits, including CustomerAsset (acquired by Firstsource), Mentorix Solutions (acquired by Lionbridge), Intigma (acquired by Emptoris), and MakeMyTrip (sale to SAIF Partners). Sandeep has also held senior roles at McKinsey & Company, Digital Equipment and EDA Systems. Sandeep has an MBA (with Distinction) from The Wharton School with a dual Major in Finance and Marketing, and a BS in Electrical Engineering from Stanford University. He is on the Board of TiE Mumbai, and is actively involved with the Entrepreneurs Organization and the Wharton and Stanford India Alumni Associations.",
    "twitter": "https://twitter.com/@aaasandeep",
    "linkedIn": "https://www.linkedin.com/in/sandeep-singhal-4467b?authType=NAME_SEARCH&authToken=4i5D&locale=en_US&trk=tyah&trkInfo=clickedVertical%3Amynetwork%2CclickedEntityId%3A164790%2CauthType%3ANAME_SEARCH%2Cidx%3A1-3-3%2CtarId%3A1481097241376%2Ctas%3ASandeep%20Singhal",
    "number": 6
  },
  
  {
    "thumbnailName": "muralidhara-kadaba",
    "name": "Mr. Muralidhara Kadaba",
    "CompanyName": "Moonbeam Capital",
    "Category": "Legal & Statutory",
    "projectImagesPath": "assets/img/jury",
    "shortDescription": "Advisor, Reliance Industries Limited & CMD, Moonbeam Capital",
    "longDescription": "Mr. Muralidhara Kadaba is an advisor to Reliance Industries Limited and Founder and CMD of Moonbeam Capital. Murali has over 20 years of corporate experience, with proven expertise in general management across consumer banking, wealth management, consumer lending, Mortgages and payment products. Murali till recently served as the President and Chief Executive of Financial Services vertical at Reliance Retail Ltd. where he was able to build India’s first Loyalty & Financial Services business in retail spanning 850 stores across 79 cities around the country in record time. Prior to joining Reliance, Murali was the Country Manager for India at American Express and Vice President and Head of Investment Products at Citibank-India.",
    "twitter": "https://twitter.com/@MurliKadaba",
    "linkedIn": "https://www.linkedin.com/in/muralidhara-kadaba-8897a57?authType=NAME_SEARCH&authToken=r0bT&locale=en_US&trk=tyah&trkInfo=clickedVertical%3Amynetwork%2CclickedEntityId%3A22860969%2CauthType%3ANAME_SEARCH%2Cidx%3A1-1-1%2CtarId%3A1481097223465%2Ctas%3AMuralidhara%20Kadaba",
    "number": 5
  },   
  
  
  {
    "thumbnailName": "sushil",
    "name": "Mr. Sushil Borde",
    "CompanyName": "Reliance Innovation Leadership Centre",
    "Category": "Business Model & Strategy, Product & Technology, Sales & Business Development",
    "projectImagesPath": "assets/img/jury",
    "shortDescription": "Vice President - Innovation, Reliance Industries Limited",
    "longDescription": "Mr. Sushil Borde is the Vice President- Innovation at Reliance Industries Limited. Sushil heads the programmes at the Reliance Innovation Leadership Centre which provides support to the Reliance Innovation Council comprising iconic global thought leaders including Nobel Laureates. Under his leadership, the centre designs, develops and deploys path breaking innovation programmes across the organization in the quest of making Reliance one of the most innovative companies in the world. Sushil has also led many other initiatives for Reliance including Mumbai Indians, a cricket franchise of the Indian Premier League (IPL). Sushil also leads some strategic initiatives as part of the Chairman’s office. Sushil has spent 7 years in South Africa where he led the Advanced Manufacturing Technology Strategy for the country. Under this programme, he spearheaded an investment agency which deployed public funds in technology programmes to make the South African manufacturing sector globally competitive.",
    "twitter": "https://twitter.com/@sushilborde",
    "linkedIn": "https://www.linkedin.com/",
    "number": 4
  },
  
  {
    "thumbnailName": "rajan_luthra",
    "name": "Mr. Rajan Luthra",
    "CompanyName": "Reliance Industries Limited",
    "Category": "Business Model & Strategy",
    "projectImagesPath": "assets/img/mentors",
    "shortDescription": "Head - Special Projects, Reliance Industries Ltd",
    "longDescription": "Mr. Rajan is responsible for strategic oversight of RIL’s Corporate Security function. Rajan is amongst India’s foremost security automation experts to have designed and program-managed security systems for critical infrastructure, retail, telecom and other premises. He has architected the world’s largest integrated automation solution covering thousands of sites, tens of thousands of cameras & sensors managed in real-time from advanced Security Operation Centres. He has been instrumental in setting up of India’s first Social Media Lab for Mumbai Police, a NASSCOM initiative in partnership with Reliance Foundation.",
    "twitter": "https://twitter.com/@RLuthra",
    "linkedIn": "https://www.linkedin.com/in/rajanluthra?authType=NAME_SEARCH&authToken=J5HW&locale=en_US&trk=tyah&trkInfo=clickedVertical%3Amynetwork%2CclickedEntityId%3A10674898%2CauthType%3ANAME_SEARCH%2Cidx%3A1-1-1%2CtarId%3A1481097254746%2Ctas%3ARajan%20Luthra",
    "number": 3
  }

]
}